First import everything you need.
This helped: https://gist.github.com/stefanthoss/364b2a99521d5bb76d51 | "syntax" comes from there

In [16]:
import pandas as pd
#import pymysql
#import mysqlclient 
from sqlalchemy import create_engine

Next make the mysql stuff accessible in here

In [17]:
# SYNTAX create_engine('mysql+pymysql://<root>:<password>@<host>[:<port>]/<dbname>')
engine = create_engine('mysql://root:root@localhost:3306/chinook')

Next get the select statement (put together in workbench). Doesn't work if it's not a single line, so it's gotta be ugly.

In [18]:
df = pd.read_sql_query('select C.LastName, C.FirstName, T.Name, A.Title from Customer C join Invoice I on C.CustomerId = I.CustomerId  join InvoiceLine IL on I.InvoiceId = IL.InvoiceId  join Track T on IL.TrackId = T.TrackId  join Album A on T.AlbumId = A.AlbumId  order by C.LastName,  C.FirstName', engine)

Show results.

In [23]:
df.head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Avi�es Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Voc� Queira Saber,Minas

Some things to note about results:
Result provided in the assignment pdf: https://i.imgur.com/yXVZAKJ.png does not match my result. However, they actually didn't show up at all when I manually looked through the database... 
Here's a small sample: https://i.imgur.com/PUlrWN4.png
That was order by C.LastName,  C.FirstName, T.Name, A.Title
As such, I'm submitting my answer as-is, and assuming that the screenshot provided in the assignment pdf is sample data and to be taken with a grain of salt.